#include "defs.h"

// 1から入力値まで各値の２乗〜６乗を表示する関数
void example01(int n)
{
    int k, k2, k3, k4, k5, k6;

    // ヘッダを表示
    printf("           k|         k^2|         k^3|         k^4|         k^5|         k^6|\n");
    printf("------------|------------|------------|------------|------------|------------|\n");

    // 結果の表示
    for(k = 1; k <= n; k++){
        k2 = k*k;
        k3 = k2*k;
        k4 = k3*k;
        k5 = k4*k;
        k6 = k5*k;
        printf("%12d|%12d|%12d|%12d|%12d|%12d|\n", k, k2, k3, k4, k5, k6);
    }

    return;
}
